{
  "MetadataInput": {
    "eip": "Адрес устройства (MAC-адрес устройства генерируется динамически на основе IP-адреса)",
    "pwd": "Пароль для доступа к устройству (максимально 3 символа)",
    "gw": "Шлюз. Имеет смысл указывать только если сервер находится за пределами текущей IP-сети. Если не указан, то в поле отображается значение 255.255.255.255",
    "sip": "IP-адрес главного сервера, на который MegaD-2561 будет отправлять сообщения о сработавших входах. После IP-адреса возможно указать порт. По умолчанию 80.",
    "sct": "Скрипт на сервере, который обрабатывает сообщения от устройства и формирует ответы (максимально 15 символов).",
    "pr": "Функция слежения за сервером. Если используется сервер (указан его IP-адрес и скрипт), то устройство примерно раз в 2 минуты проверяет его доступность и в случае, если сервер не отвечает выполняет сценарий порта, который указывается в поле Wdog. Подробнее о сценариях описано ниже.",
    "lp": "Глобальная настройка времени длительного нажатия для входов. Шаг 0,1 с. Значение по умолчанию: 10 (1 секунда).",
    "gsm": "Выбор режима UART-портов (P32/P33) - работа с GSM-модулями типа GSM-UPS, SIM800L; работа в режиме RS485-Modbus RTU и в режиме UART Raw с выбором скорости.",
    "smst": "Определяет время в секундах (от 1 до 254), в течение которого не отправлять повторные SMS о срабатывании входов. Если какой-либо вход срабатывает слишком часто, то с помощью этой опции можно сократить число отправляемых сообщений.",
    "gsm_num": "Номер телефона, на который будут отправляться SMS-сообщения. Если в настройках указан сервер, то рядом с полем UART появляется чекбокс, который указывает контроллеру на необходимость обрабатывать все входящие SMS независимо от наличия сервера. Но если сервер прописан, то контроллер, выполнив сценарий, все равно передаст текст сообщения на сервер, дабы он был в курсе происходящего.",
    "sl": "Функция периодической отправки состояния всех портов на сервер",
    "stime": "здесь можно задать время. Формат <b class='border border-secondary-subtle rounded p-1'>ЧЧ:ММ:СС:ДН</b>, то есть 15:30:00:5 - последняя цифра - день недели",
    "pty": "NC - не настроен.IN - Вход (сухой контакт). OUT - Выход/реле. DSen - Цифровой датчик. I2C - шина. ADC - АЦП (аналого-цифровой преобразователь).",
    "grp": "Поле для объединения портов в группы. Можно указать любой номер группы (от 0 до 99).",
    "ecmd": "Действие, которое необходимо произвести, в случае, когда сервер не указан, не отвечает или HTTP-статус ответа отличный от '200 OK'.",
    "af": "Определяет логику работы сценария. Если он не установлен (по умолчанию), то сценарий выполняется ТОЛЬКО если сервер не прописан, недоступен или HTTP-статус отличен от 200. Если флажок установлен, то сценарий выполняется всегда независимо от наличия сервера. Контроллер в этом случае будет сообщать на сервер о событиях, но его ответные команды в рамках одной TCP-сессии будут проигнорированы.",
    "eth": "В этом поле записывается URL, который MegaD-2561 вызывает независимо от того, есть сервер или его нет. Этот URL вызывается после попытки связи с сервером и после того, как отработает сценарий, описанный в поле Action. После IP-адреса можно указать порт. По умолчанию 80. Пример записи в поле Net: 192.168.0.15/sec/?cmd=7:2",
    "naf": "Указывает, что NetAction будет вызван ТОЛЬКО при недоступности сервера (или когда HTTP-статус ответа отличен от 200). По умолчанию вызывается всегда.",
    "mt": "Параметр отключает отправку информации на сервер о переключениях входа.",
    "hst": "Гистерезис (допустимое отклонение от порогового значения в обе стороны)",
    "pwm": "Значение от 0 до 255, соответствующее уровню выхода. 0 - нагрузка отключена, 255 - 100% мощности.",
    "pwmm": "Минимальное значение ШИМ при управлении одной кнопкой (команда ~)",
    "fr": "Частота для ШИМ-каналов. Настройка частоты ШИМ, сделанная для одного порта, распространяется и на другие порты, связанные с этим же таймером. (Таймер1: P10, P12, P13. Таймер3: P25, P27, P28. Таймер2: P11)",
    "mdid": "Имя устройства (в режиме mqtt используется как часть имени топика и/или как логин авторизации в mqtt)"
  },
  "MetadataPage": {
    "cf=7": [
      "<p><b class='border border-success rounded p-1'>Cur time:</b> текущее время. В квадратных скобках указан день недели (1-7). В частности [5] - пятница.</p>",
      "<p><b class='border border-success rounded p-1'>Set time:</b> здесь можно задать время. Формат ЧЧ:ММ:СС:ДН, то есть 15:30:00:5 - последняя цифра - день недели.</p>",
      "<p><b class='border border-success rounded p-1'>SCL/SDA:</b> порты микроконтроллера, к которым подключены часы. Здесь указывается не номер порта (как обычно), а его индекс (можно посмотреть в документации). Это сделано для того, чтобы имелась возможность подключить часы не только к разъему XT2 (зеленые клеммники внизу) и исполнительным модулям MegaD-14-IOR, но и к внутреннему 16-пиновому разъему XP4.</p>",
      "<p>В случае использования контроллера в исполнении MegaD-2561-RTC можно оставить эти поля пустыми. Контроллер сам определит наличие платы часов, подключенных к служебному разъему XP4 и синхронизируется с ними.</p>",
      "<p><b class='border border-success rounded p-1'>T/Act:</b> Сами задания. Их может быть 5 шт.</p>",
      "<p><b class='border border-success rounded p-1'>T:</b> формат ЧЧ:ММ:ДН</p>",
      "<p>Примеры:</p>",
      "<p><b class='border border-success rounded p-1'>14:30:0</b> - выполнять в 14:30 каждый день (последний 0 - означает каждый день)</p>",
      "<p><b class='border border-success rounded p-1'>08:00:3</b> - выполнить в 8:00 в среду (3 - среда)</p>",
      "<p><b class='border border-success rounded p-1'>03:15:3-7</b> - выполнять в 03:15 со среды по воскресенье включительно (3-7)</p>",
      "<p><b class='border border-success rounded p-1'>*:/03:0</b> - выполняется каждые 3 минуты. Вместо значения 'час' необходимо задать '*'. Последний ':0' - дни недели. 0 - каждый день. День недели учитывается. Можно задать выполнение циклической операции в определенные дни недели. Отсчет времени 'каждых n-минут' начинается от старта/перезагрузки контроллера.</p>",
      "<p><b class='border border-success rounded p-1'>/02:15:0</b> - выполняется каждые 2 часа в 15 минут. То есть в 2:15; 4:15; 6:15 и т.д.</p>",
      "<p><b class='border border-success rounded p-1'>Act</b> - стандартное поле сценария. Важно, что здесь работают паузы (команды p). То есть, если необходимо включить, например, автополив на 30 минут, то не обязательно разносить это на два задания. Можно ограничится одним.</p>",
      "<p>Функция cron также поддерживает запуск сценариев при старте контроллера. В поле 'T' в таком случае необходимо прописать '@reboot'.</p>",
      "<p>Выполнение сценария при старте отличается от установки состояния выхода по умолчанию (поле Default) тем, что здесь можно прописать команды для портов для расширителей, лент WS281X, групп, использовать паузы и команды повтора сценария. Ключевое слово '@reboot' можно использовать в любом из доступных полей 'T'.</p>",
      "<p>Но если вы решили использовать контроллер без часов, то синхронизировать время можно от сервера. Достаточно отправить контроллеру запрос вида.</p>",
      "<p>http://192.168.0.14/sec/?cf=7&stime=10:57:06:4</p>",
      "<p>Так как контроллер в момент своего включения отправляет на сервер сообщение с параметром 'st=1', то сервер, получив это сообщение, может установить в контроллере правильное время.</p>"
    ],
    "port-config": [
      "Поле <b class='border border-success rounded p-1'>Type</b> может принимать следующие значения:<ul>",
      "<li><b>IN</b> - Вход (например, 'сухой контакт, выключатели света', U-Sensor, датчик протечки, охранные датчики и т.д.)</li>",
      "<li><b>OUT</b> - Выход (например, включение электроприборов)</li>",
      "<li><b>DSen</b> - Цифровой датчик (например, датчики температуры DS18B20, температуры-влажности DHT22, считыватели iButton, Wiegand-26)</li>",
      "<li><b>I2C</b> - Датчики или иные устройств, подключаемые по шине I2C</li>",
      "<li><b>ADC</b> - АЦП, аналого-цифровой преобразователь (например, подключение аналоговых датчиков освещенности, давления, газа и т.д.) Доступен не для всех портов.</li>",
      "</ul>",
      "<h4>Настройка порта типа IN (Вход)</h4>",
      "<p>Порт, сконфигурированный как <b class='border border-success rounded p-1'>IN</b> (Вход) предназначен для работы с кнопками, выключателями, счетчиками импульсов, герконами, датчиками протечки, ИК-извещателями (датчиками движения), пожарными извещателеями (датчиками дыма) и другими датчиками, которые на выходе имеют два состояния: включено/выключено.</p>",
      "<p>Эта конфигурация порта может применяться для портов на клемме XT2 контроллера MegaD-2561, а также для входов исполнительных модулей: MegaD-8I7O, MegaD-14-IOR</p>",
      "<p>После того, как порт сконфигурирован как <b class='border border-success rounded p-1'>IN</b> (вход), на странице появляется несколько новых опций.</p>",
      "<p>Рядом с номером порта отображается текущее состояние входа <b class='border border-success rounded p-1'>OFF</b> (не активен), <b class='border border-success rounded p-1'>ON</b> (активен, например, когда нажат выключатель) и счетчик срабатываний входа.</p>",
      "<p><b class='border border-success rounded p-1'>Action (Act)</b> - действие, которое необходимо произвести, в случае, <mark>когда сервер не указан, не отвечает или HTTP-статус ответа отличный от '200 OK'</mark>.</p>",
      "<p>В том случае, когда контроллер работает в связке с сервером, при каждом срабатывании входа, устройство вызывает скрипт на сервере, в параметрах вызова которого указывается номер сработавшего входа. Выглядит запрос следующим образом:</p>",
      "<p class='border border-primary rounded-pill p-3'>http://192.168.0.250/megad.php?pt=2</p>",
      "<p>В ответ сервер дает указания, команду на переключение выходов. Подробнее о программировании скрипта на сервере описано ниже.</p>",
      "<p>Но в случае, если сервер не используется или используется, но не отвечает, срабатывает Action (сценарий по умолчанию). Тогда устройство самостоятельно переключает нужные выходы в соответствии с прописанным сценарием. Например, если MegaD-2561 подключен к системе для управления освещением, то пользователь не останется без света, даже когда сервер будет отключен. При работающем сервере команды будет передавать он, при неработающем - MegaD-2561 самостоятельно переключит выходы согласно тому алгоритму, который записан в поле Action.</p>",
      "<h4>Action (сценарии). Базовые принципы</h4>",
      "<p>Формат поля Action следующий: <b class='border border-success rounded p-1'>X:Y;X:Y;X:Y</b> где, <b>X</b> - номер порта, а <b>Y</b> - действие/команда</p>",
      "<p>Возможные команды:</p><ul>",
      "<li>0 - выключить;</li>",
      "<li>1 - включить;</li>",
      "<li>2 - изменить состояние на противоположное (переключить), т.е. если было включено выключить и наоборот</li>",
      "<li>3 - прямая синхронизация выхода со входом (кнопка нажата - лампа включена; кнопка отпущена - лампа выключена; только для родных входов контроллера в режиме 'P&R')</li>",
      "<li>4 - обратная синхронизация выхода со входов (кнопка нажата - лампа выключена; кнопка отпущена - лампа включена; только для родных входов контроллера в режиме 'P&R')</li>",
      "<li>[0..255] - в случае с диммируемым портами, установить значение диммера (яркости света)</li>",
      "<p class='pt-3 mb-1'>Номер порта, двоеточие, действие. Таких действий может быть несколько и тогда они разделяются точкой с запятой.</p>",
      "<p class='border border-success rounded p-3'>Пример сценария<br/>7:1;8:2<br/>Включить порт P7, переключить порт P8</p>",
      "<p>'8:2' означает, что необходимо состояние порта P8 изменить на противоположное.</p>",
      "<p>В поле Action можно записать сценарий общей длиной до 29 символов.</p>",
      "<p>Допускается вместо двоеточия использовать знак равенства, например: <b class='border border-success rounded p-1'>8=2</b></p>",
      "<p>Команды сценариев могут управлять не только выходами, но и входами. Это может потребоваться, если необходимо, например, чтобы в автономном режиме контроллера вход срабатывал только в определенные часы. Тогда сценарий переключения входа можно указать в cron (задания по расписанию).</p>",
      "<p>Вместо ON или OFF состояние отключенного входа будет DIS (от DISABLED). Счетчик не будет увеличиваться при замыкании входа.</p>",
      "<h4>Паузы в сценариях</h4>",
      "<p>В сценариях контроллер поддерживает работу с паузами. Например: <b class='border border-success rounded p-1'>7:1;p10;7:0</b> (включить выход 7, подождать 1 секунду [единица 0,1с], выключить выход 7)</p>",
      "<div class='text-light-emphasis border-start ps-3 border-warning-subtle'><p>Паузы в полном объеме и без ограничений работают только в сценариях по умолчанию (Action).</p><p>Начиная с версии прошивки 4.16b8 паузы также поддерживаются и в командах, поступающих извне. Но в этом случае одновременно может выполняться только один сценарий, содержащий паузы. Впрочем, если используется сервер, он может самостоятельно выдерживать любые паузы, не задействуя встроенный механизм контроллера.</p><br/><p>При выполнении сценария, содержащего паузу, работа контроллера не блокируется. Паузы выполняются в фоновом режиме.</p></div>",
      "<h4>Повтор сценария</h4>",
      "<p>Команда <b class='border border-success rounded p-1'>r</b>. Повтор записанного сценария несколько раз.</p>",
      "<p>Пример сценария: <b class='border border-success rounded p-1'>7:1;p5;7:0;p5;r4</b></p>",
      "<p>Включить порт 7; пауза 0,5с; выключить порт 7; пауза 0,5с; повторить все это с самого начала еще 4 раза.</p>",
      "<p>Таким образом порт включится и выключится 5 раз.</p>",
      "<p>Такую команду можно использовать для более компактной записи сложных сценариев.</p>",
      "<p>С помощью данной команды возможна организация бесконечного цикла - <b class='border border-success rounded p-1'>r0</b>.</p>",
      "<p>Пример: <b class='border border-success rounded p-1'>7:1;p5;7:0;p5;r0</b></p>",
      "<p>Выход P7 будет переключаться каждые полсекунды. Следует использовать данную функцию с осторожностью и только для особых случаев, так как в текущий момент времени в прошивке нет процедуры отмены запущенного бесконечного цикла.</p>",
      "<h4>Управление всеми выходами</h4>",
      "<p>Команда <b class='border border-success rounded p-1'>a</b>. Управление всеми выходами.</p>",
      "<p>Например: a:0 (выключить все выходы), a:1 (включить все выходы), a:2 (переключить все выходы).</p>",
      "<h4>Синхронизация входа и выхода</h4>",
      "<p>Если вход сконфигурирован как <b class='border border-success rounded p-1'>P&R</b> (читайте об этом ниже), то команда <b class='border border-success rounded p-1'>3</b> - состояние выхода <mark>соответствует состоянию входа</mark>, команда <b class='border border-success rounded p-1'>4</b> - состояние выхода <mark>противоположно состоянию входа</mark>. Команды синхронизации в текущий момент работают только с родными входами контроллера и не работают с входами расширителей. Выходами расширителей при этом управлять можно.</p>",
      "<p>Простейший пример синхронизации входа и выхода - работа кнопки звонка. При нажатии на кнопку, которая подключена на вход, включается выход, к которому подключен звонок. При отпускании кнопки, звонок выключается.</p>",
      "<p>Для корректной работы команд синхронизации необходимо, чтобы режим входа (Mode) был выбран <b class='border border-success rounded p-1'>P&R</b>. В этом режиме контроллер фиксирует оба события: замыкание и размыкание.</p>",
      "<h4>Работа с ШИМ портами</h4>",
      "<p>Если управляемый сценарием выход сконфигурирован как ШИМ (подключен диммер или конвертор 0-10В), то вместо команды указывается конкретное значение от 0 до 255. Например: 10:200</p>",
      "<p>Контроллер поддерживает команду переключения для ШИМ-порта, которая аналогична команде <b class='border border-success rounded p-1'>2</b>. Для этого используется модификатор *. Например: 10:*200</p>",
      "<p>Эта команда означает, что при первом нажатии кнопки, значение порта ШИМ будет установлено 200, а при повторном 0.</p>",
      "<h4>Команды для управления диммируемыми каналами: +, -, ~</h4>",
      "<p>Например, требуется управлять яркостью освещения двумя кнопками. Одна кнопка будет увеличивать яркость, а другая уменьшать.</p><ul>",
      "<li>Для одной кнопки необходимо прописать Сценарий: 10:+</li>",
      "<li>Для второй кнопки необходимо прописать Сценарий: 10:-</li></ul>",
      "<p>Тогда однократное нажатие на кнопку прибавления включает свет на ту величину, на которую свет был включен предыдущий раз.</p>",
      "<p>Соответственно однократное нажатие на кнопку убавления выключает свет.</p>",
      "<p>Нажатие и удержание кнопок плавно увеличивает или уменьшает яркость.</p>",
      "<div class='text-light-emphasis border-start ps-3 border-warning-subtle'><p>При использовании команды <b class='border border-success rounded p-1'>~</b> режим работы входа должен быть установлен <b class='border border-success rounded p-1'>P&R</b>.</p><p>Работает управление аналогичным образом. Однократное нажатие включает или выключает нагрузку. Удержание изменяет яркость в то или другую сторону.</p></div>",
      "<p>Иногда требуется, чтобы независимо от того, какая яркость была установлена на момент выключения, включался свет всегда на максимальную мощность.</p>",
      "<p>Для этого существует модификатор <b class='border border-success rounded p-1'>*</b>. Пример: <b class='border border-success rounded p-1'>10:~*</b></p>",
      "<p>Для каждого входа  можно указать только одну команду управления диммируемым каналом, так как вход и управляемый ШИМ-выход в данном режиме логически связываются на уровне прошивки. Это ограничение не касается любых других команд сценариев.</p>",
      "<h4>Команды для управления диммируемыми каналами: ^, v, x</h4>",
      "<p>Команды <b class='border border-success rounded p-1'>+</b>, <b class='border border-success rounded p-1'>-</b> и <b class='border border-success rounded p-1'>~</b>, описанные ранее, работают только в режиме удержания кнопки и только в автономном режиме, когда они прописаны в поле Act.</p>",
      "<p>Но что, если необходимо управлять процессом диммирования с помощью сервера?</p>",
      "<p>Плавно менять яркость с помощью сервера можно тремя способами.</p><ol>",
      "<li>С помощью отправки серии пакетов с запросом виде cmd=yy:xxx, где yy - номер порта, а xxx - значение ШИМ (PWM).</li>",
      "<li>С использованием опции smooth, с помощью которой можно было отправить только один пакет с заданной яркостью (например, cmd=12:255), а контроллер самостоятельно увеличивал/уменьшал яркость в зависимости от заданного в этой опции значения скорости.</li>",
      "<li>С помощью команд <b class='border border-success rounded p-1'>^</b>, <b class='border border-success rounded p-1'>v</b>, <b class='border border-success rounded p-1'>x</b></li></ol>",
      "<p>Команда <b class='border border-success rounded p-1'>^</b> запускает процесс увеличения яркости. Например: 12:^</p>",
      "<p>Команда <b class='border border-success rounded p-1'>v</b> запускает процесс уменьшения яркости. Например: 12:v</p>",
      "<p>Команда <b class='border border-success rounded p-1'>x</b> останавливает ранее запущенный процесс изменения яркости. Например: 12:x</p>",
      "<p>В отличие от <b class='border border-success rounded p-1'>+-~</b> эти команды может использовать сервер.</p>",
      "<p>Таким образом, сервер не задает конечное значение яркости, а запускает процесс изменения.</p>",
      "<p>Эти же команды можно использовать в сценариях. Причем в отличие от <b class='border border-success rounded p-1'>+-~</b> новые команды можно комбинировать с другими. Например: 12:^;7:2</p>",
      "<p>В этой же команде можно передавать скорость изменения яркости от 1 до 9. Пример: 12:^2 (чем меньше цифра, тем быстрее происходит изменение. По умолчанию: 5)</p>",
      "<p>Для того, чтобы остановить процесс изменения яркости достаточно снова выполнить одну из команд <b class='border border-success rounded p-1'>^</b> или <b class='border border-success rounded p-1'>v</b>.</p>",
      "<p>Эти команды расширяют возможности сервера для управления диммируемыми каналами.</p>",
      "<p>В автономном режиме (без сервера) указанные команды можно использовать с двумя кнопками, когда нажатие на одну кнопку будет изменять яркость в одну сторону (без необходимости удержания), а нажатие на вторую кнопку в другую сторону.</p>",
      "<h4>Управление лентами WS28XX</h4>",
      "<p>Лентами можно управлять не только внешними запросами, но и с помощью автономных сценариев. Для этого порт, к которому подключена адресная лента, нужно настроить как OUT/WS281X.</p>",
      "<p>В поле Chip можно указать количество чипов в ленте. Это значение учитывается при выполнении сценариев и внешних запросов с параметром <b class='border border-success rounded p-1'>ws</b>, если явно не использовать параметр <b class='border border-success rounded p-1'>chip</b>.</p>",
      "<p>В отличие от внешних запросов, в которых цвет задается с помощью 6 символов (например: ws=10FF30) в сценариях используется 3. Формат аналогичен 'CSS shorthand hex colors'. Например: F27 => FF2277. Это сделано, чтобы сократить длину сценария. Таким образом управлять лентой можно не только с помощью запроса вида: ?pt=35&ws=FF2277, но и с помощью запроса ?cmd=35:F27. Важное замечание. Цвет в 16-ричном формате задается только в верхнем регистре. Пример: AE5. Это чтобы не было путаницы с модификаторами 'a' (управление всеми выходами), 'e' (управление портами расширителей) и т.д.</p>",
      "<p>Также, как и с ШИМ портами доступен модификатор '*' - аналог команды '2' (переключение) обычных выходов в режим 'SW' (switch).</p>",
      "<p>В примере на скрине при первом нажатии лента включится цветом <b class='border border-success rounded p-1'>22FFCC</b>. При повторном нажатии выключится.</p>",
      "<h4>Обработка событий и взаимодействие с сервером</h4>",
      "<p>После срабатывания входа MegaD-2561, если прописан сервер, пытается в течение примерно 2 секунд связаться с ним. В случае неудачи, выполняется сценарий, описанный в поле Action. Также этот сценарий выполняется сразу, если сервер в сетевых настройках не прописан.</p>",
      "<p><b class='border border-success rounded p-1'>Флажок (чекбокс)</b> справа от поля Act определяет логику работы сценария. Если он не установлен (по умолчанию), то сценарий выполняется ТОЛЬКО если сервер не прописан, недоступен или HTTP-статус отличен от 200. Если флажок установлен, то сценарий выполняется всегда независимо от наличия сервера. Контроллер в этом случае будет сообщать на сервер о событиях, но его ответные команды в рамках одной TCP-сессии будут проигнорированы.</p>",
      "<p>Дополнительная команда <b class='border border-success rounded p-1'>d</b> (default). Если сервер на факт срабатывания входа, возвращает 'd', то это дает сигнал устройству выполнить сценарий по умолчанию (Act). Эта команда дублиует поведение контроллера в случае установленного флажка Act, но в этом случае сам сервер определяет когда выполнять сценарий по умолчанию.</p>",
      "<p>Таким образом можно использовать сервер вместе с командами управления диммируемыми выходами. При срабатывании входов серверу необходимо отправить устройству 'd' и он обработает все операции с клавишами выключателя. Но серверу интересно было бы знать значение ШИМ, которое получилось на выходе. Это просто. Контроллер сообщает о факте отжатия клавиши (m=1). Серверу необходимо лишь опросить состояние нужного выхода при получении сигнала об отжатии клавиши. Все остальное контроллер сделаем сам.</p>",
      "<p>Иногда требуется, чтобы сценарий, описанный в поле Act для какого-либо порта, выполнялся не по какому-то конкретному событию, а вызывался в произвольный момент времени запросом с сервера. В этом случае сервер должен в GET-запросе для нужного порта передать: <b class='border border-success rounded p-1'>cmd=d</b></p>",
      "<p>Пример: 192.168.0.14/sec/?pt=1&cmd=d</p>",
      "<p>В этом случае выполнится сценария для входа P1, не смотря на то, что физически вход не замыкался.</p>",
      "<h4>Сетевые сценарии</h4>",
      "<p><b class='border border-success rounded p-1'>NetAction (Net)</b> - В этом поле записывается URL, который MegaD-2561 вызывает независимо от того, есть сервер или его нет. Этот URL вызывается после попытки связи с сервером и после того, как отработает сценарий, описанный в поле Action. После IP-адреса можно указать порт. По умолчанию 80. Пример записи в поле Net: 192.168.0.15/sec/?cmd=7:2</p>",
      "<p>Существует несколько ситуации, когда полезно использовать эту функцию.</p><ul>",
      "<li>Предположим, в сети работает несколько устройств типа MegaD-2561/328 или любых других, которые воспринимают команды по протоколу HTTP. В случае, когда сервера нет или он недоступен, эта функция позволяет дать команду другому устройству по сети Ethernet. Например, датчик протечки подключен к одному устройству, а клапан, перекрывающий подачу воды в дом к другому. Даже если сервер не отвечает, устройство формирует команду по сети на закрытие клапана. Эта функция позволяет в значительной степени улучшить отказоустойчивость критически важных систем.</li>",
      "<li>Есть и другое применение этой функции. В сети может быть несколько устройств, которые бы хотели получать информацию об изменении состояния входов. Например, человек звонит в дверь,  компьютер включает звонок, но одновременно с этим HTTP пакет с командой NetAction получает, к примеру, телевизор, который выводит информацию о звонке на экран. Конечно, эту команду сможет сформировать и сервер, получив информацию от MegaD-2561, но с применением NetAction это будет а) быстрее б) надежнее.</li>",
      "<li>Можно придумать и другие варианты использования NetAction, которые были бы полезны: дублирование сервера, журналирование действий и прочее. К примеру, можно в сети иметь мощный производительный сервер и маленький мини-сервер (на базе роутера), который бы дублировал основные функции основного сервера в случае его недееспособности.</li>",
      "<li><b class='border border-success rounded p-1'>Флажок (чекбокс)</b> справа от поля Net указывает, что NetAction будет вызван ТОЛЬКО при недоступности сервера (или когда HTTP-статус ответа отличен от 200). По умолчанию вызывается всегда.</li></ul>",
      "<h4>Режимы работы входа. Mode</h4>",
      "<p><b class='border border-success rounded p-1'>Mode</b> - настройка, определяющая режим работы входа</p><ul>",
      "<li><b class='border border-success rounded p-1'>P</b> - устройство реагирует (то есть отправляет сообщения на сервер, выполняет сценарии и т.д.) только при замыкании контакта/выключателя (Пример: http://192.168.0.1/megad.php?pt=4)</li>",
      "<li><b class='border border-success rounded p-1'>R</b> - устройство реагирует только при размыкании контакта/выключателя. На сервер отправляется дополнительный параметр 'm=1'. (Пример: http://192.168.0.1/megad.php?pt=4&m=1)</li>",
      "<li><b class='border border-success rounded p-1'>P&R</b> - устройство реагирует как на замыкание, так и на размыкания контакта.</li>",
      "<li><b class='border border-success rounded p-1'>С</b> - Click Mode (обработка одинарных и двойных кликов/нажатий)</li></ul>",
      "<p>В режиме Click Mode:</p><ul>",
      "<li>При однократном нажатии на выключатель на сервер передается параметр click=1.<br/>Пример: /md.php?pt=0&click=1&cnt=1</li>",
      "<li>При двойном нажатии (двойной клик) на сервер передается параметр click=2.<br/>Пример: /md.php?pt=0&click=2&cnt=2</li>",
      "<li>При удержатии клавиши как и в других режимах передается параметр m=2.<br/>Пример: /md.php?pt=0&m=2&cnt=3</li>",
      "<li>После отпускания клавиши после длительного нажатия передается параметр m=1 (как в режиме P&R).<br/>Пример: /md.php?pt=0&m=1&cnt=3</li></ul>",
      "<p>Заложена специальная поддержка режима Click Mode в сценариях</p>",
      "<p>Теперь допустимо написать так: 7:2|8:2</p>",
      "<p>Это означает, что при одинарном клике выполнится 7:2, а при двойном 8:2</p>",
      "<div class='text-light-emphasis border-start ps-3 border-warning-subtle'>Необходимо отметить, что в случае одинарного клика (в режиме 'C') информация на сервер (или выполнение сценария) происходит с задержкой в 500 мс, которая требуется для фиксации двойного клика.</div>",
      "<h4>Обработка длительных нажатий</h4>",
      "<p>Часто возникает задача по-разному реагировать на длительность нажатия. Например, короткое нажатие включает/выключает свет в одной комнате, а нажатие и удержание (длительное нажатие) включает свет во всех комнатах. Работать с длительными нажатиями можно как с помощью сервера, так и автономно без сервера.</p>",
      "<p>Если используется сервер, то в том случае, когда вход (в режиме <b class='border border-success rounded p-1'>P</b> или <b class='border border-success rounded p-1'>P&R</b>) удерживается замкнутым в течение времени, заданном в поле LongP в настройках контроллера, на сервер отправляется второй запрос, в котором передается параметр m=2.</p>",
      "<p class='border border-primary rounded-pill p-3'>http://192.168.0.1/megad.php?pt=4<br/>// после удержания клавиши выключателя в течение LongP<br/>http://192.168.0.1/megad.php?pt=4&m=2</p>",
      "<p>Это в значительной степени облегчает обработку таких событий на сервере.</p>",
      "<p>Но если необходимости в этой функции нет (к примеру, используются обычные выключатели вместо кнопочных или пользователь случайно удерживает кнопку дольше обычного), и в серверном ПО функция не используется, то обязательно необходимо делать проверку на наличие параметра m=2, чтобы действия не выполнялись дважды.</p>",
      "<h4>Сценарии и длительное нажатие выключателя.</h4>",
      "<p>Начиная с версии прошивки 4.29b4 контроллер позволяет задавать автономные сценарии (Act) для длительного нажатия.</p>",
      "<h5>Для режима 'P'</h5>",
      "<p>7:2|8:2</p>",
      "<p>При однократном нажатии кнопки переключится выход P7</p>",
      "<p>При нажатии кнопки переключится сразу P7, а после удержания кнопки нажатой P8.</p>",
      "<h5>Для режима 'C' (Click Mode)</h5>",
      "<p>7:2|8:2|9:2</p>",
      "<p>Одинарный клик - переключится P7</p>",
      "<p>Двойной клик - переключится P8</p>",
      "<p>Удержание - переключится P9</p>",
      "<p>В том случае, если необходимости в выполнении действий по двойному клику нет, сценарий можно записать так: 7:2||9:2</p>",
      "<p>В этой ситуации по одинарному клику переключится P7 (контроллер не будет делать задержку, необходимую для фиксации двойного клика), а при удержании клавиши нажатой переключится P9.</p>",
      "<p><b class='border border-success rounded p-1'>Флажок (чекбокс)</b> справа от поля Mode указывает, что при наличии сервера, устройство отправляет на сервер сообщения всегда в режиме P&R, а при его отсутствии Action выполняется только в том режиме, который установлен в Mode. Данная опция не доступна для Click Mode.</p>",
      "<h4>Режим Raw</h4>",
      "<p><b class='border border-success rounded p-1'>Raw</b> - параметр отключает встроенную защиту от дребезга. При нажатии человеком на клавишу обычного выключателя или кнопки, коммутация контактов, когда две металлические пластины внутри выключателя только касаются друг друга, бывает ненадежной. За этот крайне небольшой промежуток времени, измеряемый миллисекундами, контроллер может зафиксировать десятки пограничных значений 'включено-выключено'. Этот эффект называется 'дребезгом контактов' и может генерировать большое количество ложных событий. С самого начала в контроллере заложена защита от дребезга, которая позволяет выполнять сценарий по умолчанию или отправлять сообщение на сервер только тогда, когда контакт надежен и состояние входа не меняется. Однако в определенных ситуациях эта защита может мешать. Например, в случае подключения к входам устройства энкодера или датчиков с испульсным выходом. При вращении ручки энкодера длительность контакта не превышает 10 миллисекунд. Это слишком короткий промежуток времени, чтобы встроенная защита от дребезга смогла распознать срабатывание входа. В этой ситуации можно отключить этот механизм и переложить его на сервер. Другой пример - подключение к контроллеру различных импульсных счетчиков, где длительность импульса не превышает 10-15 миллисекунд. Активация этой опции требуется для подключения датчика скорости ветра.</p>",
      "<h4>Режим Mute</h4>",
      "<p><b class='border border-success rounded p-1'>Mute</b> - параметр отключает отправку информации на сервер о переключениях входа.Часто входы используются для подсчета импульсов, которые генерируются внешними приборами: счетчиками, датчиками с импульсными выходами и т.д.Иногда количество импульсов в единицу времени бывает очень большим, что приводит к увеличению сетевого трафика и нагрузки на сервер.</p>",
      "<p>Режим 'Mute' позволяет индивидуально для конкретного порта отключить отправку информации о событиях на входе. В этом случае сервер самостоятельно опрашивает вход, получая значение счетчика, с нужной ему периодичностью.</p>",
      "<p>У режима Mute есть одна важная особенность. Даже если он включен, контроллер отправит на сервер информацию при достижении счетчика порта максимального значения 65535.</p>",
      "<p>Это позволит серверу не пропустить факт обнуления счетчика. Но кроме того, эта особенность позволяет серверу в некоторых случаях отказаться от циклического опроса и получать информацию более оперативно.</p>",
      "<p>Например, программному обеспечению сервера необходимо знать о каждых 100 импульсах на входе.</p>",
      "<p>Сервер может задать начальное значение счетчика с помощью параметра 'cnt': http://192.168.0.14/sec/?pt=0&cnt=65435.</p>",
      "<p>Когда счетчик порта достигнет 65535 (+100 относительно начального значения), контроллер отправит на сервер соответствующий GET-запрос, а сервер в ответ снова может установить нужное ему значение счетчика порта.</p>",
      "<h4>Счетчик срабатываний входа</h4>",
      "<p>Контроллер считает количество срабатываний входа. Событие, которое увеличивает счетчик, определяется настройкой типа входа. Например, в режиме 'P', контроллер считает количество замыканий, но не считает количество размыканий, а в режиме 'P&R' контроллер увеличивает счетчик как при замыкании входа, так и при размыкании.</p>",
      "<p>Значение счетчика можно увидеть в Web-интерфейсе устройства. Также это значение передается на сервер с помощью параметра 'cnt'. Таким образом, используя контроллер можно получать данные с различных счетчиков (воды, газа, электроэнергии) с импульсным выходом.</p>",
      "<p>Максимальное значение счетчика входа: 65535</p>",
      "<p>Когда счетчик достигает максимального значения, он обнуляется и счет ничинается заново.</p>",
      "<p>Сервер может обнулить или установить произвольное значение счетчика событий с помощью запроса запроса типа: 192.168.0.14/sec/?pt=0&cnt=0</p>",
      "<h4>Настройка порта типа OUT (Выход)</h4>",
      "<p>Порт, сконфигурированный как OUT (Выход) предназначен для управления различными приборами: лампами, нагревателями, клапанами, кранами, насосами, вентиляторами, двигателями, внешними реле/контакторами и любыми другими приборами.</p>",
      "<p>Эта конфигурация порта может применяться для выходов исполнительных модулей: MegaD-8I7O, MegaD-14-R, а также в отдельных случаях для клемм XT2, XP5, XP6 и модуля MegaD-14-IOR в случае подключения к ним внешних драйверов или реле (для опытных пользователей).</p>",
      "<p>Ссылки ON и OFF позволяют управлять состоянием выхода: включить, выключить.</p>",
      "<p>Default state (Def): состояние порта после включения или перезагрузки устройства. В ряде случаев требуется, чтобы отдельные приборы по умолчанию были включены.</p>",
      "<p>Если в системе используется сервер, он прописан в настройках, и порты контроллера переключались внутренней логикой: сценарий с признаком обязательного выполнения (Act с флажком), задания по расписанию (Cron), условное программирование (Program), контроллер отправляет на сервер сообщения об изменениях состояния входов (только для 'родных' портов контроллера).</p>",
      "<p class='border border-primary rounded-pill p-3'>http://192.168.0.250/megad.php?pt=7&v=1</p>",
      "<p>В данном случае запрос будет означать, что порт P7 был включен (v=1).</p>",
      "<h4>Режимы работы выхода</h4>",
      "<p><b class='border border-success rounded p-1'>Mode</b>: режим работы выхода. <b class='border border-success rounded p-1'>SW</b> - обычный ключ (ВКЛ, ВЫКЛ), <b class='border border-success rounded p-1'>PWM</b> - ШИМ (широтно-импульсная модуляция), <b class='border border-success rounded p-1'>SW LINK</b> - связанный порт, <b class='border border-success rounded p-1'>DS2413</b> - двухканальный 1-wire модуль на базе микросхемы DS2413.</p><ul>",
      "<li>Режим SW (простое переключение) устанавливается для 'релейных' или 'симисторных' выходов модулей MegaD-8I7O и MegaD-14-R.</li>",
      "<li>Режим PWM (ШИМ) предназначен для управления мощностью нагрузки, диммирования ламп, управления скоростью вращения вентилятора (для вентиляторов, способных управляться тиристорным регулятором) и других функций. Этот режим устанавливается для отдельных 'симисторных' выходов модуля MegaD-8I7O-SD. PWM (ШИМ) доступен только на портах P10 (P25), P12 (P27) и P13 (P28).</li>",
      "<li>Режим SW LINK (связанный порт) используется в тех случаях, когда необходимо предотвратить на аппаратном уровне включение двух или более портов одновременно. Это актуально для управления различными приводами (рольставен, кранов, клапанов). Данный режим предполагает, что если один из связанных портов включен, то любой другой включить уже нельзя. Для того, чтобы связать два или более портов, необходимо для каждого из них выбрать режим SW LINK и указать одинаковую группу в поле Group (любое число от 0 до 99).</li>",
      "<li>Режим DS2413 предназначен для управления внешним двухканальным модулем, работающим по протоколу 1-wire. Этот режим можно установить для любых цифровых портов. Модули на базе DS2413 можно применять в нескольких случаях: когда функциональность исполнительного модуля MegaD-8I7O избыточна и требуется всего 1-2 порта для управления нагрузками; когда портов стандартных модулей не хватило для реализации задачи и есть свободные цифровые; когда требуется вынести модуль управления нагрузками на определенное расстояние (в этом случае достаточно проложить до модуля DS2413 кабель UTP).</li></ul>",
      "<h4>Объединение выходов в группы</h4>",
      "<p><b class='border border-success rounded p-1'>Group</b>: поле для объединения портов в группы. Можно указать любой номер группы (от 0 до 99). Используется в нескольких случаях.</p><ul>",
      "<li>В режиме SW Link. В этом случае порты, для которых указан одинаковый номер в поле Group можно включить только по одному. Одновременно включить несколько портов нельзя.</li>",
      "<li>В обычном режиме SW использование групп позволяет управлять всей группой одной командой типа g7:1, где 7 - номер группы. Это позволяет сократить количество команд в сценариях.</li></ul>",
      "<h4>Особенности работы выхода в режиме PWM</h4>",
      "<p>Когда выход настроен как PWM (ШИМ), появляется возможность задать значение от 0 до 255, соответствующее уровню выхода. 0 - нагрузка отключена, 255 - 100% мощности.</p>",
      "<h4>Опция Freq</h4>",
      "<p>В ряде случае при управлении с помощью ШИМ-сигнала сторонним оборудованием возникает необходимость использовать более низкую или более высокую частоту ШИМ.</p>",
      "<p>Частоту для ШИМ-каналов можно настроить: (Norm - 3064Гц, Low - 383Гц, High - 24510Гц)</p>",
      "<div class='text-light-emphasis border-start ps-3 border-warning-subtle'><p>Настройка частоты ШИМ, сделанная для одного порта, распространяется и на другие порты, связанные с этим же таймером.</p><p>Аппаратные таймеры микроконтроллера и связанные с ними порты:</p><ul><li>Таймер1: P10, P12, P13</li><li>Таймер3: P25, P27, P28</li><li>Таймер2: P11</li></ul></div>",
      "<h4>Опция Smooth. Плавное диммирование</h4>",
      "<p>Опция Smooth позволяет воспользоваться аппаратной возможностью устройства плавно менять значение ШИМ. В поле задается скорость изменения. Значение 1 примерно равно 1 секунде при изменении значения от 0 до 255. Если указать в этом поле значение 180, то изменение от 0 до 255 будет происходить очень медленно в течение 3 минут.</p>",
      "<p>В отдельных случаях серверу может потребоваться управлять скоростью включения/выключения ШИМ порта. В этом случае менять каждый раз значение Smooth, которое хранится в энергонезависимой памяти контроллера, не нужно. Достаточно в запросе передать дополнительно параметр 'cnt'.</p>",
      "<p class='border border-primary rounded-pill p-3'>http://192.168.0.14/sec/?pt=13&pwm=255&cnt=2</p>",
      "<p>В этом случае незвисимо от настроек порта (поле Smooth) скорость изменения от 0 до 255 составит около 2 секунд (cnt=2). Данная функция работает только если включена опция Smooth. Когда необходимо при включенной опции Smooth управлять ШИМ портом мгновенно (без плавного изменения), серверу необходимо передать параметр cnt=0.</p>",
      "<h4>Опция Min. Минимальное значение ШИМ при управлении одной кнопкой (команда ~)</h4>",
      "<p>Некоторые лампы диммируются не во всем диапазоне значений ШИМ. Разные модели ламп могут начинать светиться при значении ШИМ равным 40, 100 или даже 160. В этом случае при диммировании подобных ламп одной кнопкой с помощью команды сценариев '~' возникает пауза. Контроллер плавно увеличивает значение ШИМ, но лампа в диапазоне, к примеру, 0-100 не светится. Чтобы избежать этого эффекта предусмотрено поле Min, с помощью которого можно задать порог, с которого контроллер начнет увеличивать счетчик ШИМ. Тогда контроллер от 0 сразу переходит к установленному в поле Min значению, а дальнейшее изменение ШИМ происходит в обычном режиме.</p>",
      "<p>Данное поле особенно актуально для микроконтроллерных диммеров, устанавиваемых в Моноблок и модуль MegaD-8I7O-X.</p>",
      "<p>В модуле MegaD-8I7O-SD предусмотрены аппаратные подстроечные резисторы, с помощью которых можно выставить нужный уровень свечения при минимальном значении ШИМ.</p>",
      "<h4>Особенности работы выхода в режиме DS2413</h4>",
      "<p>Данный режим выбирается в том случае, когда к цифровому порту подключены модули на базе DS2413: MegaD-2W, 1W-MM5.</p>",
      "<p>Готовые симисторные двух-канальные модули предназначены для управление двумя независимыми нагрузками 220В / 300Вт.</p>",
      "<p>Так как модули на базе микросхемы DS2413 двухканальные, в Web-интерфейсе присутствует две пары ссылок для управления каналами A и B.</p>",
      "<p>Выходами модулей DS2413 можно управлять как из встроенного Web-интерфейса, так и через сервер. Для того, чтобы указать канал, который нужно переключить, передается дополнительно 'A' или 'B'</p>",
      "<p class='border border-primary rounded-pill p-3'>Например: cmd=33B:1</p>",
      "<p>Для данного порта также доступны команды группового включения/выключения 'a:1/a:0/a:2'</p>",
      "<p>Контроллер поддерживает работу с модулями MegaD-2W/1W-MM5 (и другими модулями на базе чипа DS2413) не только в режиме один порт - один модуль, но и в режиме общей шины, когда к одному порту подключается два и более модулей.</p>",
      "<p>У каждого модуля есть свой уникальный адрес, записанный производителем микросхемы DS2413. Адрес состоит из 7 байт: 1 байт код семейства + 6 байт уникальный идентификатор.</p>",
      "<p>В режиме OUT/DS2413 в Web-интерфейсе контроллера присутствует ссылка 'Device List', по которой можно получить перечень адресов тех модулей, которые подключены к одному цифровому порту. По ссылке 'Device List' данные отображаются в следующем формате:</p>",
      "<p class='border border-primary rounded-pill p-3'>c6c439000000:OFF/OFF;15b039000000:ON/OFF</p>",
      "<p>Адреса разделяются точкой с запятой. Код семейства ('3А' для DS2413) не выводится. Выводится 48 битный уникальный идентификатор и через двоеточие состояние каналов.</p>",
      "<p>Зная этот идентификатор можно внешними GET-запросами (с сервера) управлять каналами модуля.</p>",
      "<p class='border border-primary rounded-pill p-3'>http://192.168.0.14/sec/?cmd=30A:1&addr=c6c439000000</p>",
      "<p>Указаный выше запрос включит канал 'А' модуля с адресом 'c6c439000000'.</p>",
      "<p>Если к шине подключено несколько модулей, то для включения или выключения всех каналы 'А' или 'B' всех модулей достаточно исключить из запроса параметр 'addr'.</p>",
      "<p>Адресное управление модулями недоступно в стандартных сценариях. Данный механизм работает только с внешними запросами.</p>",
      "<p>Через ссылку Device List в Web-интерфейсе контроллера (команда 'cmd=list') можно получить состояние не только модулей с выходами (MegaD-2W, 1W-MM5), но и модулей, которые используют каналы в качество входов, а также адреса и значения температурных датчиков DS18B20, если они подключены к тому же порту, к той же шине.</p>",
      "<p>Таким образом, к одному цифровому порту (а это все порты клеммы XT2 контроллера; все порты MegaD-14-IOR; порт P15 модулей MegaD-8I7O-R/S/SD, MegaD-14-R) возможно подключить много дополнительных двухканальных модулей, расширив тем самым, количество доступных управляемых выходов.</p>",
      "<p>Важно еще раз отметить, что на одну шину можно подключить не только несколько модулей типа MegaD-2W или MM5, но и несколько датчиков DS18B20.</p>",
      "<p>В том случае если, например, к порту подключен MegaD-2W и температурный датчик DS18B20, по клику на ссылку Device List отображается: 85a56a070000:85.00;79c439000000</p>",
      "<p>85.00 - это значение датчика температуры с адресом '85a56a070000', когда конвертация температуры еще не производилась.</p>",
      "<p>Настройка порта OUT, поэтому контроллер сам не отправляет команду в шину датчикам на конвертацию температуры.</p>",
      "<p>Чтобы контроллер отправил в шину команду на конвертацию, необходимо отправить запрос (пример): http://192.168.0.14/sec/?pt=32&cmd=conv</p>",
      "<p>Теперь по клику на ссылку Device List у датчиков DS18B20 будет отображаться температура (пример): 85a56a070000:24.12;79c439000000</p>",
      "<p>Сервер должен сам давать команды на конвертацию с нужной ему периодичностью.</p>",
      "<p>В 'Device List' не отображается код семейства, а только 6-байтный адрес устройства, так как пока есть возможность однозначно идентифицировать датчики температуры по наличию значения температуры.</p>",
      "<h4>Настройка порта типа ADC (АЦП)</h4>",
      "<p>Порт, сконфигурированный как ADC (АЦП) предназначен для работы с аналоговыми датчиками: датчики освещенности, газа, давления жидкости и т.д.</p>",
      "<p>Данный тип порта применяется для разъемов XP5, XP6, а также для входов исполнительного модуля MegaD-14-IOR (левое положение конфигурационного джампера) для портов с функцией АЦП (P0-P5). Выходное напряжение датчика не должно превышать 3,3В. В случае, если выходное напряжение превышает 3,3В необходимо дополнительное согласование.</p>",
      "<p>В Web-интерфейсе отображается текущее значение, формируемое АЦП микроконтроллера в диапазоне от 0 до 1023. Это значение может быть считано и конвертировано в необходимые единицы измерения (согласно документации на конкретный датчик) сервером.</p>",
      "<p>Контроллер MegaD-2561 способен не только отображать значение АЦП в Web-интерфейсе или передавать его по запросу сервера.</p>",
      "<p>Он может отслеживать значение и сообщать серверу о достижении определенного порога самостоятельно. Такая возможность позволяет избежать постоянного опроса контроллера сервером. Когда это будет необходимо, устройство само сообщит о критическом уровне. Более того, MegaD-2561 может управлять выходами в зависимости от значений подключенных датчиков.</p>",
      "<p>Например, может самостоятельно включать/выключать свет, если к АЦП-порту подключен датчик освещенности.</p>",
      "<p>Данную функциональность обеспечивают параметры Mode, Val, Action и NetAction</p>",
      "<p><b class='border border-success rounded p-1'>Mode</b> - режим работы АЦП порта</p><ul>",
      "<li><b class='border border-success rounded p-1'>N (Norm)</b>  в этом режиме значения АЦП контроллером самостоятельно не проверяются, никакие действия устройство не предпринимает</li>",
      "<li><b class='border border-success rounded p-1'>&gt;</b> Порт считается активным, если значение больше заданного порога. Активностью считается момент перехода через пороговое значение</li>",
      "<li><b class='border border-success rounded p-1'>&lt;</b> Порт считается активным, если значение меньше заданного порога. Активностью считается момент перехода через пороговое значение</li>",
      "<li><b class='border border-success rounded p-1'>&lt;&gt;</b> Порт считается активным, если значение проходит порог как в меньшую, так и в большую сторону.</li></ul>",
      "<p><b class='border border-success rounded p-1'>Val</b> - Пороговое значение</p>",
      "<p><b class='border border-success rounded p-1'>Hst</b> - Гистерезис (допустимое отклонение от порогового значения в обе стороны)</p>",
      "<p>Параметры Action и NetAction и флажки (чекбоксы) полностью соответствуют тому, что описано для портов типа In (Вход). Action - сценарий по умолчанию, который выполняется устройством. NetAction - URL, который вызывается устройством.</p>",
      "<p>При проходе значения АЦП-порта через настроенный порог на сервер отправляется запрос следующего вида (пример).</p>",
      "<p class='border border-primary rounded-pill p-3'>/md.php?pt=36&v=299&dir=1</p><ul>",
      "<li>md.php - имя скрипта, указанное в сетевых настройках</li>",
      "<li>pt=36 - номер АЦП-порта</li>",
      "<li>v=299 - текущее значение АЦП-порта</li>",
      "<li>dir=1 - направление перехода (снизу вверх - 1, сверху вниз - 0)</li></ul>",
      "<h4>Настройка порта типа DSen (цифровые датчики и устройства)</h4>",
      "<p>Порт, сконфигурированный как DSen предназначен для работы с цифровыми датчиками и устройствами, работающими по цифровым шинам.</p>",
      "<p>Данный тип порта применяется для разъема XT2 контроллера MegaD-2561, а также для любых входов цифровых портов стандартных исполнительных модулей.</p>",
      "<p>В данном режиме контроллер поддерживает работу с датчиками: DHT11/DHT22 (также более известными как AM2302), датчиками DS18B20 (1W), любыми считывателями, поддерживающими протокол 1-wire (iButton, TouchMemory) и работу с DS1990A (считыватели 'таблеток', а также считыватели EM-Marine/Mifare в режиме эмуляции, например, CP-Z2L/CP-Z2M, Matrix-II), любыми считыватели, поддерживающими протокол Wiegand-26 (W26).</p>",
      "<h4>Локальный и 'удаленный' термостат с помощью DS18B20 и MegaD-2561</h4>",
      "<p>Порт, настроенный для работы с датчиком температуры DS18B20, может не только отображать температуру или передавать ее на сервер. У порта есть режим термостата, когда можно управлять нагрузкой в зависимости от значения температуры. Принцип настройки аналогичен АЦП-порту. А также доступны команды '3' и '4', синхронизирующие значение температуры и состояние выхода. Например, если мы установим режим (Mode) '&lt;&gt;', значение температуры (Val) 29, гистерезис (Hst) 0.50, а сценарий (Act) 7:3, то когда температура будет выше 29.5 градусов, выход P7 будет включен, а когда ниже 28.5, то выключен. Гистерезис работает в обе стороны от заданного порога.</p>",
      "<p>А кроме того, устройство может управлять не только локальным выходом, но и выходом другого устройства. Для этого в поле Net мы прописываем, например '192.168.0.15/sec/?cmd=8:3'. Тогда порт 8 совершенно другого устройства будет синхронизирован со значением температуры так, словно этот порт локальный. Разумеется, доступны и другие стандартные команды: выключить - '0', включить - '1', переключить - '2'.</p>",
      "<p>Иногда требуется изменить значение термостата внешним HTTP-запросом без перезагрузки контроллера и записи этого значения в энергонезависимую память.</p>",
      "<p>Делается это командой вида: http://192.168.0.14/sec/?pt=32&misc=24 где pt=32 - номер порта, misc=24 - значение термостата.</p>",
      "<h4>Подключение датчиков DS18B20 шиной (несколько на один порт)</h4>",
      "<p>Контроллер MegaD-2561 поддерживает подключение цифровых датчиков DS18B20 шиной (несколько на один порт). Для этого в Web-интерфейсе контроллера выбрать типа датчика: 1WBUS</p>",
      "<p>При нажатии на ссылку Device List или через запрос вида http://192.168.0.14/sec/?pt=32&cmd=list Можно получить в ответ следующий результат: 8aad6a070000:32.43;85a56a070000:32.43</p>",
      "<p>Результат отображается по следующему принципу: [адрес датчика]:[температура];[адрес датчика]:[температура];</p>",
      "<p>Контроллер автоматически каждые 30 секунд отправляет в шину команду на конвертацию температуры, но при этом самостоятельно, без внешней команды, не считывает данные о температуре. Поэтому для данного режима не предусмотрена функция термостата, не производится ежеминутная передача данных о температуре через MQTT.</p>",
      "<p>Если шина занята конвертацией, то в ответ вернется просто 'Busy', но можно отправить такой запрос и вручную (или автоматически при опросе с сервера), вызвав URL вида http://192.168.0.14/sec/?pt=32&cmd=conv</p>",
      "<div class='text-light-emphasis border-start ps-3 border-warning-subtle'><p>При подключении датчиков шиной крайне желательно обеспечить датчикам питание (от контроллера, +3,3В).</p><p>При подключении датчиков по схеме паразитного питания датчики могут периодически или всегда отображать температуру 85.00 градусов.</p></div>"
    ]
  }
}